#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main()
{
	int a;							//令随机数为a，作为炸弹
	int p;							//用于储存旧的炸弹位置
	int b;							//设置可变数字b，用于储存玩家输入的位置
	int c0;							//设置效果随机变量为c0
	int c1;							//设置上效果随机数为c1
	int c2;							//设置下效果随机数为c2
	int g = 0;						//用于判定特殊效果是否触发，0为未触发，1或者2为触发
	int max = 100;					//定义最大值且初始值为100
	int min = 1;					//定义最小值且初始值为1
	int s;							//用于设定游戏规则
	int k;							//用于结束游戏
	ICE:							//标记位置ICE，用于重开游戏
	printf("游戏开发：凌柃|创作参考：数字炸弹|游戏版本：3.3\n");
	printf("指令代码：101--查询特殊效果位置参考|102--强制结束游戏|103--直接重开游戏\n");
	srand((unsigned)time(NULL));	//定义rand函数种子
	s = rand() % 10 + 1;			//随机生成s值,范围为1——10
	a = rand() % 100 + 1;			//随机数最大值为100，最小值为1
	c0 = rand() % 30 + 1;			//生成效果随机变量，范围为1——30
	c1 = a + c0;
	if (c1>100)
	{
		c1 = c1 - 100;
	}
	c2 = a - c0;
	if (c2<1)
	{
		c2 = c2 + 100;
	}
	max = 100;						//用于重开之后更新提示范围
	min = 1;						//用于重开之后更新提示范围
	printf("游戏初始化已完成，特殊效果位于炸弹%d范围内\n", c0);			//给定特殊效果位置参考
	if (s<6)															//生成游戏规则
	{
		printf("请注意，引爆炸弹的为“胜利者”\n");
	}
	else
	{
		printf("请注意，引爆炸弹的为“失败者”\n");
	}
	printf("请输入数字：");
	fflush(stdin);
	scanf_s("%d", &b);
	do									//核心区！
	{
		p = a;							//记录旧的炸弹位置
		if (b == 101)					//查询特殊效果位置参考，代码101
		{
			printf("特殊效果位于炸弹%d范围内\n", c0);					//给定特殊效果位置参考
			b = 0;						//将可变数字归零
			printf("请再次输入：");
			fflush(stdin);
			scanf_s("%d", &b);
			continue;
		}
		if (b==102)						//强制结束游戏，代码102
		{
			printf("游戏已执行强制结束代码\n");
			break;
		}
		if (b==103)						//直接重开游戏，代码103
		{
			printf("\n已重开游戏\n");
			goto ICE;
		}
		if (b==c1)											//特殊效果处理与判定
		{
			printf("触发特殊效果，炸弹位置更新\n");
			printf("新的炸弹位置位于1——%d之间\n", a);
			a = rand() % p + 1;								//新的炸弹会生成于小于等于旧位置的区域内，可能位置不变
			g = 1;											//特殊效果触发，更改g值
		}
		if (b==c2)
		{
			printf("触发特殊效果，炸弹位置更新\n");
			printf("新的炸弹位置位于%d——100之间\n", a);
			a = rand() % (100 - p + 1) + p;					//新的炸弹会生成于大于等于旧位置的区域内，可能位置不变
			g = 2;											//特殊效果触发，更改g值
		}
		if (g>0)											//判断特殊效果是否触发，如果触发则更新特殊效果位置
		{
			c1 = a + c0;
			if (c1 > 100)
			{
				c1 = c1 - 100;
			}
			c2 = a - c0;
			if (c2 < 1)
			{
				c2 = c2 + 100;
			}
			if (g==1)
			{
				max = p;				//更新最大值为新范围最大值
				min = 1;				//更新最小值为新范围最小值
			}
			if (g==2)
			{
				max = 100;				//更新最大值为新范围最大值
				min = p;				//更新最小值为新范围最小值
			}
			g = 0;						//恢复g值，防止特殊效果位置发生“非法”变更
			b = 0;						//将可变数字归零
			if (min==max)				//解决极端情况：当只剩1或者100时重新在1——100的范围内生成炸弹
			{
				a = rand() % 100 + 1;	//生成新的炸弹，范围1——100
				c1 = a + c0;
				if (c1 > 100)
				{
					c1 = c1 - 100;
				}
				c2 = a - c0;
				if (c2 < 1)
				{
					c2 = c2 + 100;
				}
				min = 1;
				max = 100;
				printf("由于只剩下一个数字，故在1——100范围内重新生成炸弹\n");
			}
			printf("请再次输入：");
			fflush(stdin);
			scanf_s("%d", &b);
			continue;
		}
		if (b==a)						//处理bug：一开始是炸弹不会爆
		{
			break;
		}
		if (b > a)
		{
			printf("这个数字比较大·+\n");
			if (max > b)				//记录当前最大值
			{
				max = b;
			}
		}
		else
		{
			printf("这个数字比较小·-\n");
			if (min < b)				//记录当前最小值
			{
				min = b;
			}
		}
		printf("—·—当前最小值为*%d*,最大值为*%d*—·—\n", min, max);	//输出当前有效范围
		b = 0;							//将可变数字归零
		printf("请再次输入：");
		fflush(stdin);
		scanf_s("%d", &b);
	} while (b != a);					//游戏结束判定：当b=a时结束循环，游戏结束
	printf("——BOOM!——\n-游戏结束-\n炸弹是：");
	printf("%d\n", a);
	if (s < 6)							//最后告知游戏规则
	{
		printf("另外，恭喜触发者获胜！\n");
	}
	else
	{
		printf("很遗憾，触发者为失败者\n");
	}
	printf("输入除103之外的任意字符并回车结束\n");
	printf("输入代码103并回车可直接开启下一局\n");
	fflush(stdin);
	scanf_s("%d", &k);					//保持窗口显示
	if (k==103)							//直接重开游戏，代码103
	{
		printf("\n已重开游戏\n");
		goto ICE;
	}
	return 0;
}
